[
  {
    "name": "Donald Wilson",
    "description": "Donald Wilson is the president of the United States Table Soccer Organization (USTSO) and a longtime foosball promoter. As USTSO president he oversees tournaments and coordinates U.S. participation in international events, and he has served as tournament director for major ITSF events such as the World Series in Dallas. Wilson also competed at a high level; he won the Goalie War event at the 2004 World Championships and has been active in the sport for decades. Donald's leadership keeps the USTSO engaged in global foosball and supports the sport’s growth in the United States."
  },
  {
    "name": "Robert Mares",
    "description": "Robert Mares is a professional foosball player originally from Tucson, Arizona who now plays out of Denver, Colorado. Known for his fast reflexes and front‑pin rollover shot, he captured the Masters singles title in 1994 and later used that same offense to defeat champion Terry Moore in a memorable final. Mares is regarded as a one of the games top stars and currently serves as vice president of USA Foosball. As a board member he helps lead the World Cup selection committee and promotes the sport nationwide."
  },
  {
    "name": "Maryam Aly",
    "description": "Maryam Aly is a world‑class foosball player. She co‑founded InsideFoos in 2020, a digital foosball media platform. In November 2024 she joined the United States Table Soccer Organization as board member and sports commissioner, leading national competitive standards and representing the USTSO in international forums. On the table, Aly has captured titles such as the 2025 Tornado World Series Women’s Doubles and the Illinois State Women’s Singles and Doubles championships, and she continues to coach, referee and inspire the next generation of players."
  },
  {
    "name": "Terry Rue",
    "description": "Terry Rue is a veteran foosball competitor from Louisiana, known as part of the ‘family of foos’ because his wife and daughters also play at a high level. He started playing as a child and won his first Tornado table in the mid‑1990s; he still practices daily and competes across the United States. Rue achieved a standout performance when he placed third in singles at the 2021 Tornado World Championship and won doubles the previous year with partner Robert Mares. Off the table he works as chief of anesthesia at Lafayette General Hospital and serves as treasurer on the USA Foosball board, promoting the sport and mentoring new players."
  },
  {
    "name": "Tracy McMillan",
    "description": "Tracy McMillan is a seasoned American foosball player celebrated for his powerful pull‑shot offense; in a poll of top players he appears alongside legends. He continues to compete internationally and recently won a bronze medal in the mixed‑seniors division at the Foosball World Cup with partner Lotus Leong‑Chesbrough. McMillan has a long history of tournament success and is known for his strategic play and sportsmanship. As a USA Foosball board member he contributes his experience to guide the organization’s activities and support the next generation of players."
  },
  {
    "name": "Jim Provost",
    "description": "Jim Provost is a passionate foosball enthusiast who has represented the Us at the highest levels of competition. In 2025 he and partner Neil Millman represented the United States at the International Table Soccer Federation competition in Murcia, Spain, finishing high among the teams in the senior doubles event. Jim continues to support the sport as a board member and competitor."
  },
  {
    "name": "Tom Yore",
    "description": "Tom Yore is a Tampa, Florida foosball star who plays forward and is famous for his pull‑shot offense. During the 1990s he amassed numerous titles, including the 1997 U.S. Open Open Singles championship (his second tour title of that year) and the Hall of Fame Classic Mixed Doubles championship with Christina Fuchs, adding to earlier wins at the 1994 Nationals Open Doubles and the 1996 Masters Open Mixed. Yore continued his success with additional victories in 1997 events such as the Florida State championships and 2‑Ball Rollerball. Beyond playing, he serves as president of the International Table Soccer Federation Rules Commission, where he led the creation of new official rules for the 2006 World Cup and oversees referee training."
  }
]
